app/controllers/votes_controller.rb

  def create
    @vote = Vote.new(params[:vote].merge({:ip => request.remote_ip}))
    @vote.save
---
INSERT INTO "votes" ("updated_at", "positive", "ip", "created_at") VALUES('2009-10-10 16:59:23', 't', '127.0.0.1', '2009-10-10 16:59:23')